/*작성자 : 황지원
12월 28일 HW2 :화폐단위 환산 프로그램 작성*/
#include <stdio.h>


int main()
{
	int money = 278970;
	int m_50000, m_10000, m_5000, m_1000, m_500, m_100, m_50, m_10;

	m_50000 = money / 50000;                 //몫만 남음(ex.5)
	printf("50000원권 => %d개\n", m_50000);  //윗줄에서 5로 나눈 값 안넣고 이 줄에서 바로 5로 나눈 값 쓰면 안됨! 5곱해서 뺴줘야 하니까 필요.
	money -= m_50000 * 50000;                //5(몫)*50000원 빼줘서 나머지 구함. money는 계속 누적값으로 쓰이게 됨.

	m_10000 = money / 10000;
	printf("10000원권 => %d개\n", m_10000);
	money -= m_10000 * 10000;

	m_5000 = money / 5000;
	printf("5000원권 => %d개\n", m_5000);
	money -= m_5000 * 5000;

	m_1000 = money / 1000;
	printf("1000원권 => %d개\n", m_1000);
	money -= m_1000 * 1000;

	m_500 = money / 500;
	printf("500원권 => %d개\n", m_500);
	money -= m_500 * 500;

	m_100 = money / 100;
	printf("100원권 => %d개\n", m_100);
	money -= m_100 * 100;

	m_50 = money / 50;
	printf("50원권 => %d개\n", m_50);
	money -= m_50 * 50;

	m_10 = money / 10;
	printf("10원권 => %d개\n", m_10);
	money -= m_10 * 10;

	return 0;                      //반환값 0 : 정상종료 의미함.
}

